# 标准算术运算符 + - * / //[整除]
# 取余运算符 %
# 幂运算 **
# 整除运算一正一负的时候向下取整
# 取余（一正一负要公式  余数=被除数-除数*商）

print(9 // 4)  # 2
print(-9 // -4)  # 2
print(-9 // 4)  # -3
print(9 // -4)  # -3

print(9 % 4)  # 1
print(-9 % -4)  # -1
print(9 % -4)  # -3  9-(-4)*(-3)
print(-9 % 4)  # 3  -9 - 4 * (-3) = 3

print('-------------------链式赋值------------------------')
a = b = c = 20
print(a, id(a))
print(b, id(b))
print(c, id(c))

print('-------------------参数赋值------------------------')
# +=  -=  *=   /=   //=  %=
d = 20
d += 10
print(d)
d -= 5
print(d)

print('-------------------支持系列解包赋值------------------------')
e, f, g = 11, 12, 13
print(e, id(e))
print(f, id(f))
print(g, id(g))

print('-------------------交换变量的值------------------------')
i, g = 16, 17
print('交换之前: i = ' + str(i) + ',g = ' + str(g))
i, g = g, i
print('交换之后: i = ' + str(i) + ',g = ' + str(g))

print('-------------------比较运算符------------------------')

# 比较运算符 结果为bool类型
# >, < ,>= ,<= ,!= ,==  , is   , is not
# == 比较的是两个变量的值
# is,is not 比较的是两个变量的标识
# 当两个变量的值相同，且变量是基础类型是，python将引用同一个标识
m = 10
n = 10
p = 11
print(m, id(m))
print(n, id(n))
print(p, id(p))
print(m is n) # True
print(m is not p) # True
arr1 = [10, 20, 30]
arr2 = [10, 20, 30]
print('arr1', id(arr1))
print('arr2', id(arr2))
print(arr1 is arr2) # False


print('-------------------布尔运算符------------------------')
# and, or, not, in, not in

# 位运算符
# &[按位与，对应位数都是1，结果为数才是1],|[按位或，对应位数都是0，结果位数才是0],<<[左移位，高位溢出舍弃，低位补0，每左移一位相当于乘以2],>>[右移位，低位溢出舍弃，高位补0，每右移一位相当于除以2]

# 运算符优先级
# 算术运算符 > 位运算 > 比较运算 > 布尔运算 > 赋值运算